<!-- add-pr-comment:add-pr-comment -->

## Terraform github repositories plan
```
module.ministryofjustice.module.coat-cur-data-pipeline.github_repository.default: Preparing import... [id=coat-cur-data-pipeline]
module.ministryofjustice.module.cloud-optimisation-and-accountability.github_repository.default: Preparing import... [id=cloud-optimisation-and-accountability]
data.github_team.cloud_optimisation_and_accountability: Reading...
module.ministryofjustice.module.coat-cur-data-pipeline.github_repository.default: Refreshing state... [id=coat-cur-data-pipeline]
module.ministryofjustice.module.cloud-optimisation-and-accountability.github_repository.default: Refreshing state... [id=cloud-optimisation-and-accountability]
module.ministryofjustice.module.coat-cur-data-pipeline.github_branch_protection.default: Preparing import... [id=coat-cur-data-pipeline:main]
data.github_team.cloud_optimisation_and_accountability: Read complete after 4s [id=12623342]
module.ministryofjustice.module.coat-cur-data-pipeline.github_team_repository.admin["12623342"]: Preparing import... [id=12623342:coat-cur-data-pipeline]
module.ministryofjustice.module.coat-cur-data-pipeline.github_team_repository.admin["12623342"]: Refreshing state... [id=12623342:coat-cur-data-pipeline]
module.ministryofjustice.module.cloud-optimisation-and-accountability.github_team_repository.admin["12623342"]: Preparing import... [id=12623342:cloud-optimisation-and-accountability]
module.ministryofjustice.module.cloud-optimisation-and-accountability.github_team_repository.admin["12623342"]: Refreshing state... [id=12623342:cloud-optimisation-and-accountability]
module.ministryofjustice.module.cloud-optimisation-and-accountability.github_branch_protection.default: Preparing import... [id=cloud-optimisation-and-accountability:main]
module.ministryofjustice.module.coat-cur-data-pipeline.github_branch_protection.default: Refreshing state... [id=BPR_kwDOPEW5ds4D2jgG]
module.ministryofjustice.module.cloud-optimisation-and-accountability.github_branch_protection.default: Refreshing state... [id=BPR_kwDOOWCmUs4Dq9DA]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ministryofjustice.module.cloud-optimisation-and-accountability.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "cloud-optimisation-and-accountability"
    }

  # module.ministryofjustice.module.cloud-optimisation-and-accountability.github_branch_protection.default must be replaced
  # (imported from "cloud-optimisation-and-accountability:main")
  # Warning: this will destroy the imported resource
-/+ resource "github_branch_protection" "default" {
        allows_deletions                = false
        allows_force_pushes             = false
        blocks_creations                = false
        enforce_admins                  = true
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOOWCmUs4Dq9DA" -> (known after apply)
        lock_branch                     = false
        pattern                         = "main"
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOOWCmUg" -> "cloud-optimisation-and-accountability" # forces replacement
        require_conversation_resolution = false
        require_signed_commits          = false
        required_linear_history         = false

      ~ required_pull_request_reviews {
            dismiss_stale_reviews           = true
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
            require_code_owner_reviews      = true
            require_last_push_approval      = false
            required_approving_review_count = 1
          - restrict_dismissals             = false -> null
        }

      ~ required_status_checks {
          - contexts = [] -> null
            strict   = false
        }
    }

  # module.ministryofjustice.module.cloud-optimisation-and-accountability.github_repository.default will be updated in-place
  # (imported from "cloud-optimisation-and-accountability")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "A GitHub repository for the Cloud Optimisation and Accountability Team • This repository is defined and managed in Terraform"
        etag                        = "W/\"a6cd726f738b28e3a23b69c37b93e0921a773eeeccdb227a713472c7c2aa85e0\""
        full_name                   = "ministryofjustice/cloud-optimisation-and-accountability"
        git_clone_url               = "git://github.com/ministryofjustice/cloud-optimisation-and-accountability.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://cloud-optimisation-and-accountability.justice.gov.uk/"
        html_url                    = "https://github.com/ministryofjustice/cloud-optimisation-and-accountability"
        http_clone_url              = "https://github.com/ministryofjustice/cloud-optimisation-and-accountability.git"
        id                          = "cloud-optimisation-and-accountability"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cloud-optimisation-and-accountability"
        node_id                     = "R_kgDOOWCmUg"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 962635346
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/cloud-optimisation-and-accountability.git"
        svn_url                     = "https://github.com/ministryofjustice/cloud-optimisation-and-accountability"
        topics                      = [
            "cloud-optimisation-and-accountability",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        pages {
            build_type = "workflow"
            cname      = "cloud-optimisation-and-accountability.justice.gov.uk"
            custom_404 = false
            html_url   = "https://cloud-optimisation-and-accountability.justice.gov.uk/"
            url        = "https://api.github.com/repos/ministryofjustice/cloud-optimisation-and-accountability/pages"

            source {
                branch = "main"
                path   = "/"
            }
        }

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.cloud-optimisation-and-accountability.github_team_repository.admin["12623342"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"b9b105583b57ade3c424e2d2e2f504f79e6c6989be9ef8fffe8138a8341decba\""
        id         = "12623342:cloud-optimisation-and-accountability"
        permission = "admin"
        repository = "cloud-optimisation-and-accountability"
        team_id    = "12623342"
    }

  # module.ministryofjustice.module.coat-cur-data-pipeline.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "coat-cur-data-pipeline"
    }

  # module.ministryofjustice.module.coat-cur-data-pipeline.github_branch_protection.default must be replaced
  # (imported from "coat-cur-data-pipeline:main")
  # Warning: this will destroy the imported resource
-/+ resource "github_branch_protection" "default" {
        allows_deletions                = false
        allows_force_pushes             = false
        blocks_creations                = false
        enforce_admins                  = true
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDOPEW5ds4D2jgG" -> (known after apply)
        lock_branch                     = false
        pattern                         = "main"
      - push_restrictions               = [] -> null
      ~ repository_id                   = "R_kgDOPEW5dg" -> "coat-cur-data-pipeline" # forces replacement
        require_conversation_resolution = false
        require_signed_commits          = false
        required_linear_history         = false

      ~ required_pull_request_reviews {
            dismiss_stale_reviews           = true
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
            require_code_owner_reviews      = true
            require_last_push_approval      = false
            required_approving_review_count = 1
          - restrict_dismissals             = false -> null
        }

      ~ required_status_checks {
          - contexts = [] -> null
            strict   = false
        }
    }

  # module.ministryofjustice.module.coat-cur-data-pipeline.github_repository.default will be updated in-place
  # (imported from "coat-cur-data-pipeline")
  ~ resource "github_repository" "default" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
      + archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
        delete_branch_on_merge      = true
        description                 = "A GitHub repository for the Cloud Optimisation and Accountability Team Cost and Usage Report Data Pipeline  • This repository is defined and managed in Terraform"
        etag                        = "W/\"2d535d655da7a762a90b77b4fd27d5390dc0534ccb002fa6fd7c9fd4718806ac\""
        full_name                   = "ministryofjustice/coat-cur-data-pipeline"
        git_clone_url               = "git://github.com/ministryofjustice/coat-cur-data-pipeline.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://cloud-optimisation-and-accountability.justice.gov.uk/"
        html_url                    = "https://github.com/ministryofjustice/coat-cur-data-pipeline"
        http_clone_url              = "https://github.com/ministryofjustice/coat-cur-data-pipeline.git"
        id                          = "coat-cur-data-pipeline"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "coat-cur-data-pipeline"
        node_id                     = "R_kgDOPEW5dg"
        primary_language            = "Dockerfile"
        private                     = false
        repo_id                     = 1011202422
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:ministryofjustice/coat-cur-data-pipeline.git"
        svn_url                     = "https://github.com/ministryofjustice/coat-cur-data-pipeline"
        topics                      = [
            "cloud-optimisation-and-accountability",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "enabled"
            }
            secret_scanning_push_protection {
                status = "enabled"
            }
        }

        template {
            include_all_branches = false
            owner                = "ministryofjustice"
            repository           = "analytical-platform-airflow-python-template"
        }
    }

  # module.ministryofjustice.module.coat-cur-data-pipeline.github_team_repository.admin["12623342"] will be imported
    resource "github_team_repository" "admin" {
        etag       = "W/\"673320964fbd7b0ec8e3fa852fa340d4646b7a635310c3cfda4ad1f22d96b7b6\""
        id         = "12623342:coat-cur-data-pipeline"
        permission = "admin"
        repository = "coat-cur-data-pipeline"
        team_id    = "12623342"
    }

Plan: 6 to import, 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```